#У вас є дві дати в кортежі з трьома числами - рік, місяць і день.
#Наприклад, 19 квітня 1982 буде (1982, 4, 19). Ви повинні знайти різницю в днях між наявними датами.
#Наприклад, між сьогодні і вчора = 1 день.
#Різниця між днями завжди буде позитивною або нулем, не забувайте про абсолютне значення.
#Вхідні дані: Дві дати, як кортежі цілих чисел.
#Вихідні дані: Різниця між датами в днях, як ціле число.

a1 = input("Ведите первую дату (Пример: 1999 12 12) дату  ").split()
b1 = input("Ведите вторую дату (Пример: 1999 12 12) дату  ").split()

a = [int() for x in a1]
b = [int() for x in b1]

g = a[0]
m = a[1]
d = a[2]

g1 = b[0]
m1 = b[1]
d1 = b[2]

dd1 = g * 365 + m * 28 + d
dd2 = g1 * 365 + m1 * 28 + d1

n = dd2 - dd1

print(n)
